[
  {
    "verb": "blow * up +",
    "meaning": "make explode;destroy using explosives",
    "examples": 
      "The terrorists blew the bridge up.The family were injured when their house blew up because of a gas leak."
    
  },
  {
    "verb": "blow up",
    "meaning": "suddenly become very angry",
    "examples": 
      "When Joan heard the news, she blew up and rushed out of the room. I broke her iPad and she blew up at me."
   
  },
  {
    "verb": "break * down +",
    "meaning": "analyze in detail",
    "examples": 
      "We need to break this problem down in order to solve."
    
  },
  {
    "verb": "break down",
    "meaning": "stop working properly and become mentally ill",
    "examples": 
      "The truck broke down in the desert.Our marriage has broken down and we are getting a divorce. And She broke down after her husband died. She had a nervous breakdown after her son was kidnapped."
    
  },
 
  {
    "verb": "bring about +",
    "meaning": "make something happen",
    "examples": 
      "The politician introduced new laws that might bring about some positive change."
    
  },
  {
    "verb": "bring back",
    "meaning": "return and return to consciousness",
    "examples": 
      "Whenever you borrow a book from the library you must bring it back AND Sometimes when people die they are able to be brought back to life."
    
  },  
  {
    "verb": "bring in",
    "meaning": "yield as profit or income",
    "examples": 
      "Fishermen always try to bring in a large catch.Most part-time work does not bring in much money."
   
  },
  {
    "verb": "bring * up +",
    "meaning": "mention AND raise (a child)",
    "examples": 
      "I didn't want to bring up the fact that she was unemployed. AND Sam was brought up in South Carolina."
    
  },
  {
    "verb": "bring up",
    "meaning": "vomit",
    "examples": 
      "Babies often bring up their food, but that phase soon passes."
    
  },
  {
    "verb": "call back",
    "meaning": "return a phonecall AND to a place to see somebody again",
    "examples": 
      "I must call her back when we get to the office. AND Mrs Bottone is in a meeting. Can you call back this afternoon, please?"
    
  },  
  {
    "verb": "call * off +",
    "meaning": "cancel something AND order to stop (an invasion, guard dogs)",
    "examples": 
      "They called the picnic off because of the rain. The police called off their search for the burglar after they found him hiding in a shed. AND He called off the dogs when he saw it was his neighbor.OK, I agree to your demands. You can call your lawyers off now."
   
  }, 
  {
    "verb": "call round",
    "meaning": "visit someone, usually for a short period of time.",
    "examples": 
      "I think I'll call round and see if my grandmother needs anything.Why don't you call round tomorrow? We can have a cup of tea and a chat."
    
  },
  {
    "verb": "carry on +",
    "meaning": "continue (a conversation, a game)",
    "examples": 
      "Please, carry on. I didn't mean to interrupt you."
    
  },
  {
    "verb": "carry on about +",
    "meaning": "continue in an annoying way",
    "examples": 
      "He kept carrying on about how much money he makes."
    
  },
  {
    "verb": "carry on with +",
    "meaning": "continue",
    "examples": 
      "I want you to carry on with the project while I am out of town."
    
  },
  {
    "verb": "carry * out +",
    "meaning": "complete and/or accomplish something",
    "examples": 
      "The secret agent carried out his orders exactly as planned.Grandma, let me help you carry out the boxes to the car."
    
  },
  {
    "verb": "check in/into +",
    "meaning": "enter a hospital, hotel etc.",
    "examples": 
      "They need to check in before noon.They checked into the hotel at 11:00 AM."
    
  },
  {
    "verb": "check into +",
    "meaning": "investigate, look for (often through a service)",
    "examples": 
      "We are checking into discount flights to London."
    
  },
  {
    "verb": "cheer up",
    "meaning": "become cheerful",
    "examples": 
      "Cheer up. Everything will be all right. You look sad. What can I do to cheer you up?"
   
  },
  {
    "verb": "come back",
    "meaning": "return",
    "examples": 
      "What time are you coming back?"
    
  },
  {
    "verb": "come down",
    "meaning": "drop AND descend to someone through inheritance AND attack/scold vigorously",
    "examples": 
      "I can’t afford the new TVs so I’ll wait for the prices to come down to a more reasonable price.When I turned 21 my father gave me a ring that has come down from generation to generation.When I stole a toy from store my mother came down on me harshly."
   
  }, 
  {
    "verb": "come on",
    "meaning": "hurry up AND flirt aggressively AND follow",
    "examples": 
      "Come on, we’re waiting for you and the show starts in 3 minutes!AND Won-mo came on to me during our major’s MT, but I have no romantic feelings for him. AND Come on, Matt, I insist that you go with us to the concert."
   
  },  
  {
    "verb": "come out",
    "meaning": "appear AND reveal you are homosexual AND turn out, end up",
    "examples": 
      "I didn't see the car at first. It came out of nowhere. AND Sam finally came out last month. AND The pictures came out great."
    
  },
  {
    "verb": "come out with +",
    "meaning": "produce and distribute a product",
    "examples": 
      "Microsoft is coming out with a new video game system next month."
    
  },
  {
    "verb": "come up",
    "meaning": "happen unexpectedly",
    "examples": 
      "I planned on visiting you last night, but something came up and I was unable to visit.When snorkeling I can only stay underwater for 1 minute and then I must come up for air."
    
  },
  {
    "verb": "come up to +",
    "meaning": "approach; to equal",
    "examples": 
      "The job offer didn't come up to her expectations."
    
  },
  {
    "verb": "find out",
    "meaning": "discover",
    "examples": 
      "Vicky's parents are going to be so mad when they find out she got a tattoo.One of the best ways to learn is to find out how other people do things"
    
  },
  {
    "verb": "get back",
    "meaning": "return",
    "examples": 
      "Brandon pranked me last Halloween, so this year I am going to get him back.I can’t wait to get back my car that is in the shop."
    
  },
  {
    "verb": "get on",
    "meaning": "advance in age",
    "examples": 
      "Although my grandmother thinks she is young she is getting on in age."
    
  },
  {
    "verb": "get * on",
    "meaning": "put on (clothes)",
    "examples": 
      "You should get your jacket on because it's going to be cold."
    
  },
  {
    "verb": "get on / +",
    "meaning": "enter (a bus, train), mount (a horse, a bike)",
    "examples": 
      "The train is leaving. Quick, get on!Get on my bike and I will give you a ride home."
    
  },
  {
    "verb": "get on with +",
    "meaning": "have a good relationship",
    "examples": 
      "Natasha doesn't get on with her co-workers. Do you get on with your neighbors?"
    
  },
  {
    "verb": "get out",
    "meaning": "produce or complete",
    "examples": 
      "I must get this work out before the deadline comes!"
    
  },
  {
    "verb": "get out of +",
    "meaning": "exit (a small boat, car, an enclosed area)",
    "examples": 
      "I fell into the water when I tried to get out of the canoe.Most inmates can’t wait until they get out of prison."
    
  },
  {
    "verb": "get * up",
    "meaning": "cause someone to rise (from a sitting position or a lying position)",
    "examples": 
      "Ahmed got Abdul up at 5:30 in the morning by turning the music up really loud."
    
  },
  {
    "verb": "get up",
    "meaning": "rise (from sitting position or a bed)",
    "examples": 
      "What time did you get up this morning?"
    
  },
  {
    "verb": "give up",
    "meaning": "surrender AND quit",
    "examples": 
      "Never give up learning English! If after my 4th try to pass the teachers’ exam I will give up and work in another profession.AND If you smoke, make every effort to give up. If you don’t then it is probable you’ll get cancer."
    
  },
  {
    "verb": "go back",
    "meaning": "return",
    "examples": 
      "When are you going back to your house? I'd rather die than go back out the way I was."
    
  },
  {
    "verb": "go down",
    "meaning": "decrease AND be accepted",
    "examples": 
      "The cost of flight tickets is going down. AND Joining the Army won’t go down well with Dad. You know he dislikes the military."
    
  },
  {
    "verb": "go in for +",
    "meaning": "participate ( inf.)",
    "examples": 
      "Are you going to go in for soccer this year at school?"
    
  },
  {
    "verb": "go into +",
    "meaning": "discuss in detail",
    "examples": 
      "I really don't want to go into that now."
    
  },
  {
    "verb": "go off",
    "meaning": "explode AND begin, start (used with signals, alarms, warning sounds) AND stop (said of a machine) AND become angry AND leave AND happen (as planned)",
    "examples": 
      "The bomb could go off at any moment.The alarm clock went off at 6:00 AM. At track events a pistol goes off to signify the start of a race.The DVD player goes off automatically if you are not using it.Maria went off last night after I told her about losing her bike."
    
  }, 
  {
    "verb": "go on",
    "meaning": "continue AND happen",
    "examples": 
      "Please, go on. Don't let me interrupt you.I wish class would finish, but my professor’s lecture just keeps going on and on and on!AND This place is a mess! What went on here last night?"
    
  },
  {
    "verb": "go on with +",
    "meaning": "continue (a plan, a conversation)",
    "examples": 
      "I think we should go on with the meeting and stop wasting time."
    
  },
  {
    "verb": "go out",
    "meaning": "stop burning (a fire)AND take part in social activities (usually at night)",
    "examples": 
      "The fire went out after three days.AND They love to go out every Saturday night.When couples start dating they usually go out on the town and have dinner, watch a movie, or other such activities."
    
  },  
  {
    "verb": "go up",
    "meaning": "increase AND be in the process of construction",
    "examples": 
      "Her total tax bill could go up sharply. AND Several new KNUE buildings are going up in 2007 and 2008."
    
  },  
  {
    "verb": "hold * up +",
    "meaning": "delay (a flight, traffic) AND rob (a bank, a person) with a weapon AND make the electrical connections required for a machine or information service",
    "examples": 
      "The accident held traffic up for an hour. AND Five men held the bank up yesterday. AND Can you hook up the fax machine for me?"
    
  },
  {
    "verb": "look back on +",
    "meaning": "to remember nostalgically",
    "examples": 
      "When I look back on my childhood, I often feel angry."
    
  },
  {
    "verb": "look down on +",
    "meaning": "see as inferior",
    "examples": 
      "She's so conceited. She looks down on everybody else."
    
  },
  {
    "verb": "look out",
    "meaning": "be careful, pay attention, heed a certain danger",
    "examples": 
      "Look out, there's a black widow spider on the wall."
    
  },
  {
    "verb": "look * up +",
    "meaning": "locate and visit AND search for information",
    "examples": 
      "If you ever travel to California, you should look me up. AND Sometimes when I reminisce I look up old friends on the Internet.I takes time to look up new vocabulary words."
    
  },
  {
    "verb": "look up to +",
    "meaning": "respect, admire someone",
    "examples": 
      "He looks up to his father."
    
  },
  {
    "verb": "make * up +",
    "meaning": "invent (a story) AND complete what was missed AND put on cosmetics",
    "examples": 
      "Don't believe anything she says. She always makes things up. AND Fortunately, my professor let me make up the exam I missed yesterday. AND I takes me 10 minutes to make my face up."
    
  },
  {
    "verb": "make up",
    "meaning": "reconcile",
    "examples": 
      "You two have been friends for so long that I think you should make up."
    
  },
  {
    "verb": "make up for +",
    "meaning": "compensate for",
    "examples": 
      "Allen made up for being late by getting me flowers."
    
  },
  {
    "verb": "pick * up +",
    "meaning": "come and get someone in a car AND learn something without effort AND try to initiate a relationship with someone (often in a bar)",
    "examples": 
      "What time are you going to pick me up. AND It's possible to pick up enough English in two weeks to get by on your trip to Los Angeles. AND Some weird guy tried to pick Patricia up at the bar."
    
  },
  {
    "verb": "pick up",
    "meaning": "grow, increase (inf.) AND go faster",
    "examples": 
      "Business is really picking up this quarter.AND It took me 3 months to learn to play that song, but my brother picked it up in 2 days!"
    
  },
  {
    "verb": "point * out +",
    "meaning": "indicate",
    "examples": 
      "I'd like to point out that figures in column two might be outdated.The victim pointed out the criminal from a police lineup."
    
  },
  {
    "verb": "put * down +",
    "meaning": "insult, say bad things about",
    "examples": 
      "She always puts down people who don't share her opinions."
    
  },
  {
    "verb": "put * out +",
    "meaning": "extinguish (a fire) AND inconvenience someone",
    "examples": 
      "Don't use water to put out a grease fire. AND I don't want to put you out, but could you pick me up at the airport."
    
  },
  {
    "verb": "put out +",
    "meaning": "spend (usually used with unreasonably large sums of money)",
    "examples": 
      "I can't put out that much money each month."
    
  },
  {
    "verb": "put * up",
    "meaning": "have a guest stay in your house for a short time",
    "examples": 
      "Can you put me up while I'm in town."
    
  },
  {
    "verb": "put up with +",
    "meaning": "tolerate",
    "examples": 
      "Sandy will not put up with smoking in her house."
    
  },
  {
    "verb": "set off",
    "meaning": "cause to be ignited/exploded",
    "examples": 
      "When setting off fireworks you must be very careful not to get injured."
    
  },
  {
    "verb": "set * off",
    "meaning": "anger someone",
    "examples": 
      "My brother really set me off when he said that I didn’t love my parents as much as he."
    
  },
  {
    "verb": "set * up",
    "meaning": "arrange a relationship AND falsely incriminate a person",
    "examples": 
      "My mom set me up with her friend's son. AND I don't think he killed those men. Somebody set him up."
    
  },  
  {
    "verb": "set up +",
    "meaning": "arrange (an appointment, a meeting, etc.)",
    "examples": 
      "I set up an appointment with my doctor at 3:30 this afternoon."
    
  },
  {
    "verb": "sit down",
    "meaning": "encamp or besiege",
    "examples": 
      "Sit down and stop your noise!The military sat down around all entry and exit points of the city."
    
  },
  {
    "verb": "take * back +",
    "meaning": "retract something you said AND return an item to a store",
    "examples": 
      "I demand that you take back what you said. AND The dress my grandmother bought for me didn't fit, so I took it back and exchanged it for a pair of pants.I decided I didn’t want the DVD so I took it back to the store for a refund."
    
  },
  {
    "verb": "take * off",
    "meaning": "when a plane or rocket leaves the ground",
    "examples": 
      "My stomach felt funny when the plane took off.When birds are startled they always take off as fast as possible."
    
  },
  {
    "verb": "take * off +",
    "meaning": "remove AND leave work or school for a period of time",
    "examples": 
      "In many cultures, it is appropriate to take off your shoes when entering a house. AND I was sick last week, so I took a few days off of work."
    
  },  
  {
    "verb": "take off",
    "meaning": "leave AND become popular and successful",
    "examples": 
      "We took off after dinner. AND When the Noraebang was introduced to Korea the concept took off very quickly."
    
  },
  {
    "verb": "take on +",
    "meaning": "accept (responsibilities, work)",
    "examples": 
      "She has taken on too much responsibility in this project."
    
  },
  {
    "verb": "take * out +",
    "meaning": "accompany a person on a date (for dinner, the movies)",
    "examples": 
      "I can't meet you tonight because I am taking Fernanda out to dinner."
    
  },
  {
    "verb": "take * over +",
    "meaning": "take control of",
    "examples": 
      "Who is going to take over the family business when Aretha's father dies?"
    
  },
  {
    "verb": "take over",
    "meaning": "take control",
    "examples": 
      "If the President is assassinated, the Vice-president will take over."
    
  },
  {
    "verb": "take * up +",
    "meaning": "begin a new hobby AND discuss (at a later date) AND shorten a garment when sewing",
    "examples": 
      "Have you taken up any new hobbies since you moved here? AND We should take this issue up in the meeting tomorrow. AND This dress is too long, I am going to take it up."
    
  },
  {
    "verb": "take up +",
    "meaning": "occupy space",
    "examples": 
      "This couch takes up too much space in the living room."
    
  },
  {
    "verb": "turn * out",
    "meaning": "produce AND switch off a light",
    "examples": 
      "The weavers can turn out two or three rugs a month. AND Turn out the light before you go to bed."
    
  },
  {
    "verb": "turn out",
    "meaning": "audience members to a function AND end up being",
    "examples": 
      "Over 100,000 people turned out for the concert. AND She turned out to be the murderer after all."
    
  },
  {
    "verb": "turn * up +",
    "meaning": "increase the volume or intensity of a TV, radio, or other machine",
    "examples": 
      "Turn up the TV. I can't hear what they're saying."
    
  },
  {
    "verb": "turn up",
    "meaning": "find unexpectedly",
    "examples": 
      "My keys turned up in the bedroom."
    
  },
  {
    "verb": "work * out +",
    "meaning": "solve",
    "examples": 
      "I hope you two can work out your problems."
    
  },
  {
    "verb": "work out",
    "meaning": "exercise AND be successful",
    "examples": 
      "I work out three times a week at the fitness center. AND I am glad your new catering business is working out."
    
  }
 
]
